; --- ATTACHMENTS ---

[FreeKillUpgrade_ABB_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Compensator"
FriendlyNamePlural="Compensators"
BriefSummary="Adds +1 critical damage."
TinySummary="Adds +1 critical damage."
LootTooltip="This weapon upgrade, when installed, adds a small bonus to critical damage."

[FreeKillUpgrade_ABB_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Compensator"
FriendlyNamePlural="Advanced Compensators"
BriefSummary="Adds +2 critical damage."
TinySummary="Adds +2 critical damage."
LootTooltip="This weapon upgrade, when installed, adds a medium bonus to critical damage."

[FreeKillUpgrade_ABB_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Compensator"
FriendlyNamePlural="Superior Compensators"
BriefSummary="Adds +3 critical damage."
TinySummary="Adds +3 critical damage."
LootTooltip="This weapon upgrade, when installed, adds a sizeable bonus to critical damage."

[FreeKillUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Compensator"
FriendlyNamePlural="Compensators"
BriefSummary="Adds +1 critical damage."
TinySummary="Adds +1 critical damage."
LootTooltip="This weapon upgrade, when installed, adds a small bonus to critical damage."

[FreeKillUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Compensator"
FriendlyNamePlural="Advanced Compensators"
BriefSummary="Adds +2 critical damage."
TinySummary="Adds +2 critical damage."
LootTooltip="This weapon upgrade, when installed, adds a medium bonus to critical damage."

[FreeKillUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Compensator"
FriendlyNamePlural="Superior Compensators"
BriefSummary="Adds +3 critical damage."
TinySummary="Adds +3 critical damage."
LootTooltip="This weapon upgrade, when installed, adds a sizeable bonus to critical damage."

[AimUpgrade_ABB_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Penetrator Scope"
FriendlyNamePlural="Penetrator Scopes"
BriefSummary="Shots from this weapon can't be dodged. Adds +1 armor pierce"
TinySummary="Prevent Graze, Pierce Armor"
LootTooltip="This weapon upgrade will prevent shots from being dodged by the enemy. All shots will pierce some armor."

[AimUpgrade_ABB_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Penetrator Scope"
FriendlyNamePlural="Advanced Penetrator Scopes"
BriefSummary="Shots from this weapon can't be dodged. Adds +2 armor pierce"
TinySummary="Prevent Graze, Pierce Armor"
LootTooltip="This weapon upgrade will prevent shots from being dodged by the enemy. All shots will pierce some armor."

[AimUpgrade_ABB_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Penetrator Scope"
FriendlyNamePlural="Superior Penetrator Scopes"
BriefSummary="Shots from this weapon can't be dodged. Adds +3 armor pierce"
TinySummary="Prevent Graze, Pierce Armor"
LootTooltip="This weapon upgrade will prevent shots from being dodged by the enemy. All shots will pierce some armor."

[AimUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Penetrator Scope"
FriendlyNamePlural="Penetrator Scopes"
BriefSummary="Shots from this weapon can't be dodged. Adds +1 armor pierce"
TinySummary="Prevent Graze, Pierce Armor"
LootTooltip="This weapon upgrade will prevent shots from being dodged by the enemy. All shots will pierce 1 points of armor."

[AimUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Penetrator Scope"
FriendlyNamePlural="Advanced Penetrator Scopes"
BriefSummary="Shots from this weapon can't be dodged. Adds +2 armor pierce"
TinySummary="Prevent Graze, Pierce Armor"
LootTooltip="This weapon upgrade will prevent shots from being dodged by the enemy. All shots will pierce 2 points of armor."

[AimUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Penetrator Scope"
FriendlyNamePlural="Superior Penetrator Scopes"
BriefSummary="Shots from this weapon can't be dodged. Adds +3 armor pierce"
TinySummary="Prevent Graze, Pierce Armor"
LootTooltip="This weapon upgrade will prevent shots from being dodged by the enemy. All shots will pierce 3 points of armor."

[MissDamageUpgrade_ABB_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Marksman's Stock"
FriendlyNamePlural="Marksman's Stocks"
BriefSummary="Allows to stabilize your shots for a small aim bonus."
TinySummary="Stabilized Shot"
LootTooltip="This weapon upgrade will add the Stabilized Shot ability to your weapon, which uses both actions but adds a +5 aim bonus."

[MissDamageUpgrade_ABB_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Marksman's Stock"
FriendlyNamePlural="Advanced Marksman's Stocks"
BriefSummary="Allows to stabilize your shots for a medium aim bonus."
TinySummary="Stabilized Shot"
LootTooltip="This weapon upgrade will add the Stabilized Shot ability to your weapon, which uses both actions but adds a +10 aim bonus."

[MissDamageUpgrade_ABB_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Marksman's Stock"
FriendlyNamePlural="Superior Marksman's Stocks"
BriefSummary="Allows to stabilize your shots for a significant aim bonus."
TinySummary="Stabilized Shot"
LootTooltip="This weapon upgrade will add the Stabilized Shot ability to your weapon, which uses both actions but adds a +15 aim bonus."

[MissDamageUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Marksman's Stock"
FriendlyNamePlural="Marksman's Stocks"
BriefSummary="Allows to stabilize your shots for a small aim bonus."
TinySummary="Stabilized Shot"
LootTooltip="This weapon upgrade will add the Stabilized Shot ability to your weapon, which uses both actions but adds a +5 aim bonus."

[MissDamageUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Marksman's Stock"
FriendlyNamePlural="Advanced Marksman's Stocks"
BriefSummary="Allows to stabilize your shots for a medium aim bonus."
TinySummary="Stabilized Shot"
LootTooltip="This weapon upgrade will add the Stabilized Shot ability to your weapon, which uses both actions but adds a +10 aim bonus."

[MissDamageUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Marksman's Stock"
FriendlyNamePlural="Superior Marksman's Stocks"
BriefSummary="Allows to stabilize your shots for a significant aim bonus."
TinySummary="Stabilized Shot"
LootTooltip="This weapon upgrade will add the Stabilized Shot ability to your weapon, which uses both actions but adds a +15 aim bonus."

[StabilizedShotM1 X2AbilityTemplate]
LocFriendlyName="Stabilize and Fire Weapon"
LocHelpText="Fire a shot at a target. +5 aim, uses both actions."
LocLongDescription="Firing the primary weapon always ends a unit's turn."

[StabilizedShotM2 X2AbilityTemplate]
LocFriendlyName="Stabilize and Fire Weapon"
LocHelpText="Fire a shot at a target. +10 aim, uses both actions."
LocLongDescription="Firing the primary weapon always ends a unit's turn."

[StabilizedShotM3 X2AbilityTemplate]
LocFriendlyName="Stabilize and Fire Weapon"
LocHelpText="Fire a shot at a target. +15 aim, uses both actions."
LocLongDescription="Firing the primary weapon always ends a unit's turn."

[ABB_GoodEye X2AbilityTemplate]
LocFriendlyName="Smart Scope"
LocLongDescription="Your shots can't be dodged."
LocHelpText="Your shots can't be dodged."
LocFlyOverText="Smart Scope"

[ReloadUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Auto-Loader"
FriendlyNamePlural="Auto-Loaders"
BriefSummary="The first reload in a mission does not cost an action. On shotguns, provides Full Reload ability instead."
TinySummary="Free Reloads"
LootTooltip="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to. On shotguns, instead provide an ability to fully reload."

[ReloadUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Auto-Loader"
FriendlyNamePlural="Advanced Auto-Loaders"
BriefSummary="The first <Ability:ALRELOADCOUNT/> reloads in a mission do not cost an action. On shotguns, provides Full Reload ability instead."
TinySummary="Free Reloads"
LootTooltip="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to. On shotguns, instead provide an ability to fully reload."

[ReloadUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Auto-Loader"
FriendlyNamePlural="Superior Auto-Loaders"
BriefSummary="The first <Ability:ALRELOADCOUNT/> reloads in a mission do not cost an action. On shotguns, provides Full Reload ability instead."
TinySummary="Free Reloads"
LootTooltip="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to. On shotguns, instead provide an ability to fully reload."

; --- --- ---